In [96]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [76]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [77]:
df[['name','age','state']]  #takes first three comumns

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [78]:
df.loc[2:4,{'name','age'}]  #grabs 2nd through 4th row

   age   name
2   22  peter
3   19   jeff
4   45   bill

In [79]:
df.iloc[:2]   #grabs firwst two rows

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [80]:
df.iloc[-2:]  #last two rows

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [81]:
#Select first column without specifiying the name of column

df.iloc[:,0]

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [82]:
df.loc[:,['age','state']]  #age and state

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [83]:
#second row in DF
df.iloc[1]

name            mary
age               78
state             dc
num_children       2
num_pets           4
Name: 1, dtype: object

In [84]:
#peoples whose "age" is greater then 30
df[df['age']>30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [85]:
df[df.age>30]  #same as above

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [86]:
df[df.num_pets>df.num_children]  #select people with more pets then children

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [87]:
##Older then 40 and owns pets
df[(df.age > 40) & (df.num_pets>0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [88]:
df.drop(["age","num_children"],axis=1)
#drop number of children and age

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [89]:
#What is the average age, number of pets, and children
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [90]:
#What is the average age, number of pets, and children (aanother way)
import numpy as np

df[['age','num_pets','num_children']].apply(lambda col: np.mean(col), axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [91]:
df[['age']]  #returns dataframe

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [92]:
df['age'] #returns just the data in the dataframe

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [93]:
##return DF where all age is multiplied by 2
import numpy as np

df[['age']].apply(lambda age: age*2, axis=0)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [97]:
##Original datafraame with all values but age multiplied by 2 makes it perminant
df['age'] = df['age'].apply(lambda x: x*2)
df

    name  age       state  num_children  num_pets
0   john   46        iowa             2         0
1   mary  156          dc             2         4
2  peter   44  california             0         0
3   jeff   38       texas             1         5
4   bill   90  washington             2         0
5   lisa   66          dc             1         0

In [102]:
#sort dataframe based on a specific comumn in ascending order
df.sort_values("age",ascending= True)

    name  age       state  num_children  num_pets
3   jeff   38       texas             1         5
2  peter   44  california             0         0
0   john   46        iowa             2         0
5   lisa   66          dc             1         0
4   bill   90  washington             2         0
1   mary  156          dc             2         4

In [108]:
#Select rows whos name begins with the letter 'j'
df[df.apply(lambda row: row['name'].startswith('j'), axis=1)]

   name  age  state  num_children  num_pets
0  john   46   iowa             2         0
3  jeff   38  texas             1         5

In [109]:
df[df['name'].apply(lambda x: x =="j")]  ##Get this to work

Empty DataFrame
Columns: [name, age, state, num_children, num_pets]
Index: []

In [115]:
### Dataframe reshaping

from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)

In [116]:
## PIVOT TABLE

In [122]:
p = d.pivot(index='Item', columns="CType", values='USD')

p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$